000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.    BREAKS.                                           00020099
000300 AUTHOR.        CSU0041 DARIUS LITTLE.                            00030017
000400**************************************************************    00040000
000500*                                                            *    00050000
000600*    ACCOUNTS RECEIVABLE PROGRAM SERIES FOR CPSC3111, ETC.   *    00060000
000700*    FORMAT OF THE SELECT STATEMENT FOR THE DATA FILES USED. *    00070000
000800*                                                            *    00080000
000900**************************************************************    00090000
001000                                                                  00100000
001100 ENVIRONMENT DIVISION.                                            00110000
001200 CONFIGURATION SECTION.                                           00120001
001300 SOURCE-COMPUTER.                                                 00130001
001400     Z13                                                          00140001
001500     WITH DEBUGGING MODE                                          00150001
001600     .                                                            00160001
001700                                                                  00170001
001800 INPUT-OUTPUT SECTION.                                            00180000
001900 FILE-CONTROL.                                                    00190000
002000     SELECT INV-FILE              ASSIGN TO MYINFILE.             00200013
002100     SELECT PRINT-FILE            ASSIGN TO MYREPORT.             00210000
002200                                                                  00220000
002300 DATA DIVISION.                                                   00230000
002400 FILE SECTION.                                                    00240000
002500                                                                  00250000
002600 FD  INV-FILE                                                     00260013
002700     RECORDING MODE IS F.                                         00270000
002800 01  INV-REC.                                                     00280010
002900     10  FILLER                  PIC X(080).                      00290000
003000                                                                  00300000
003100 FD  PRINT-FILE                                                   00310000
003200     RECORDING MODE IS F.                                         00320000
003300 01  PRINT-REC.                                                   00330000
003400     10  FILLER                  PIC X(132).                      00340000
003500                                                                  00350000
003600 WORKING-STORAGE SECTION.                                         00360000
003700                                                                  00370000
003800 01  WS-COUNTERS-FLAGS.                                           00380000
003900     10  EOF-FLAG                PIC X(03) VALUE "NO ".           00390000
004000     10  WS-SPACING              PIC 9(01) VALUE 2.               00400000
004100     10  REC-COUNT               PIC 9(05) VALUE ZERO.            00410000
004200     10  WS-LINE-COUNT           PIC 9(03) VALUE 0.               00420018
004300     10  WS-PAGE                 PIC 9(03) VALUE 0.               00430018
004400                                                                  00440099
004500 01  CONTROL-FIELDS.                                              00450099
004600     10  HOLD-DIV                PIC X(02).                       00460099
004700     10  HOLD-DEPT               PIC X(03).                       00470099
004800                                                                  00480099
004900 01  DEPT-TOTALS.                                                 00490099
005000     10  DEPT-AMT                PIC S9(07)V99 VALUE 0.           00500099
005100     10  DEPT-DISC               PIC S9(07)V99 VALUE 0.           00510099
005200     10  DEPT-NET                PIC S9(07)V99 VALUE 0.           00520099
005300     10  DEPT-TOT                PIC S9(07)V99 VALUE 0.           00530099
005400                                                                  00540099
005500 01  DIV-TOTALS.                                                  00550099
005600     10  DIV-AMT                 PIC S9(07)V99 VALUE 0.           00560099
005700     10  DIV-DISC                PIC S9(07)V99 VALUE 0.           00570099
005800     10  DIV-NET                 PIC S9(07)V99 VALUE 0.           00580099
005900                                                                  00590099
006000 01  FINAL-TOTALS.                                                00600036
006100     10  FIN-AMOUNT              PIC S9(07)V99 VALUE 0.           00610086
006200     10  FIN-DISCOUNT            PIC S9(07)V99 VALUE 0.           00620086
006300     10  FIN-NET                 PIC S9(07)V99 VALUE 0.           00630086
006400                                                                  00640041
006500 01  WORK-FIELDS.                                                 00650036
006600     10  WS-DISCOUNT             PIC S9(05)V99 VALUE 0.           00660099
006700     10  WS-NET                  PIC S9(05)V99 VALUE 0.           00670086
006800     10  WS-DISCPCT              PIC  9(01)V99 VALUE 0.           00680093
006900                                                                  00690099
007000     COPY RECEIVE.                                                00700000
007100                                                                  00710004
007200 01  WS-PRINT-REC                VALUE SPACES.                    00720005
007300     10  FILLER                  PIC X(01).                       00730099
007400     10  PR-DIV                  PIC X(02).                       00740099
007500     10  FILLER                  PIC X(01).                       00750099
007600     10  PR-DPT                  PIC X(03).                       00760099
007700     10  FILLER                  PIC X(01).                       00770099
007710         10 FIN-MSG.                                              00771099
007720            15 PR-CUST           PIC X(10).                       00772099
007730            15 PR-NAME           PIC X(20).                       00773099
008100     10  FILLER                  PIC X(05).                       00810099
008200     10  PR-AMT                  PIC ZZZ,ZZZ.99.                  00820099
008300     10  ERR-MSG.                                                 00830099
008400         15  PR-DISCOUNT         PIC ZZZ,ZZZ.99.                  00840099
008500         15  FILLER              PIC X(01).                       00850099
008600         15  PR-NET              PIC ZZZ,ZZZ.99.                  00860099
008700         15  PR-AST              PIC X(03).                       00870099
008800         15  FILLER              PIC X(02).                       00880099
009100     10  FILLER                  PIC X(01).                       00910099
009200                                                                  00920034
009300 01  WS-DATE.                                                     00930018
009400     10  YY                      PIC 9(02).                       00940018
009500     10  MM                      PIC 9(02).                       00950018
009600     10  DD                      PIC 9(02).                       00960018
009700                                                                  00970018
009800 01  WS-TIME.                                                     00980018
009900     10  HH                      PIC 9(02).                       00990018
010000     10  MN                      PIC 9(02).                       01000018
010100     10  SS                      PIC 9(02).                       01010018
010200     10  MS                      PIC 9(02).                       01020018
010300                                                                  01030018
010400 01  HEADING-1.                                                   01040018
010500     10  FILLER                  PIC X(02) VALUE SPACES.          01050018
010600     10  H-DATE.                                                  01060018
010700         15  H-MM                PIC 9(02).                       01070018
010800         15  H-SLASH1            PIC X(01) VALUE '/'.             01080018
010900         15  H-DD                PIC 9(02).                       01090018
011000         15  H-SLASH2            PIC X(01) VALUE '/'.             01100018
011100         15  H-YY                PIC 9(02).                       01110018
011200     10  FILLER                  PIC X(03) VALUE SPACES.          01120018
011300     10  H-TIME.                                                  01130018
011400         15  H-HH                PIC Z9.                          01140018
011500         15  H-COLON             PIC X(01) VALUE ':'.             01150018
011600         15  H-MN                PIC 9(02).                       01160018
011700     10  FILLER                  PIC X(04) VALUE SPACES.          01170018
011800     10  FILLER                  PIC X(40) VALUE                  01180018
011900         'PROGRAM 5, (41) DARIUS LITTLE          '.               01190099
012000     10  FILLER                  PIC X(05) VALUE SPACES.          01200018
012100     10  FILLER                  PIC X(06) VALUE 'PAGE: '.        01210018
012200     10  H-PAGE                  PIC Z(03).                       01220018
012300                                                                  01230018
012400 01  HEADING-2.                                                   01240018
012500     10  FILLER                  PIC X(40) VALUE                  01250018
012600         ' DV DPT VENDOR #  VENDOR NAME         '.                01260099
012700     10  FILLER                  PIC X(40) VALUE                  01270018
012800         '      INV AMT  DISC AMT    NET INV   '.                 01280099
012900                                                                  01290006
013000 PROCEDURE DIVISION.                                              01300006
013100                                                                  01310006
013200 010-START-HERE.                                                  01320006
013300     OPEN INPUT INV-FILE                                          01330015
013400     OPEN OUTPUT PRINT-FILE                                       01340006
013500     PERFORM 100-READ-INPUT                                       01350006
013600     MOVE REC-DIV TO HOLD-DIV                                     01360099
013700     MOVE REC-DEPT TO HOLD-DEPT                                   01370099
013800     PERFORM 850-GET-DATE                                         01380018
013900     PERFORM 800-PRINT-HEADINGS                                   01390018
014000                                                                  01400006
014100     PERFORM 300-PROCESS-DATA                                     01410006
014200       UNTIL EOF-FLAG = "YES"                                     01420006
014300                                                                  01430086
014400     PERFORM 900-PRINT-TOTALS                                     01440042
014500     CLOSE INV-FILE                                               01450014
014600     CLOSE PRINT-FILE                                             01460016
014700     GOBACK.                                                      01470006
014800                                                                  01480006
014900 100-READ-INPUT.                                                  01490009
015000     READ INV-FILE INTO WS-REC                                    01500006
015100       AT END                                                     01510006
015200         MOVE "YES" TO EOF-FLAG                                   01520006
015300     END-READ                                                     01530006
015400     ADD 1 TO REC-COUNT.                                          01540006
015500                                                                  01550006
015600 300-PROCESS-DATA.                                                01560006
015700     IF REC-DIV NOT EQUAL TO HOLD-DIV                             01570099
015800         PERFORM 600-DIV-TOTALS                                   01580099
015900     ELSE                                                         01590099
016000         IF REC-DEPT NOT EQUAL TO HOLD-DEPT                       01600099
016100             PERFORM 650-DEPT-TOTALS                              01610099
016200         END-IF                                                   01620099
016300     END-IF                                                       01630099
016400     MOVE REC-CUST TO PR-CUST                                     01640099
016500     MOVE REC-NAME TO PR-NAME                                     01650099
016600     MOVE REC-DIV TO PR-DIV                                       01660099
016700     MOVE REC-DEPT TO PR-DPT                                      01670099
016800     MOVE REC-INV-AMT TO PR-AMT                                   01680006
016900     PERFORM 400-CALC-DISCOUNT                                    01690036
017000     PERFORM 700-PRINT-LINE                                       01700018
017100     PERFORM 100-READ-INPUT.                                      01710088
017200                                                                  01720082
017300 400-CALC-DISCOUNT.                                               01730086
017400     IF VALID-DISC                                                01740094
017500         PERFORM 450-GET-DISC-PCT                                 01750099
017600         MOVE WS-DISCOUNT TO PR-DISCOUNT                          01760099
017700         SUBTRACT WS-DISCOUNT FROM REC-INV-AMT GIVING WS-NET      01770099
017800         MOVE WS-NET TO PR-NET                                    01780099
017900         PERFORM 500-CALC-TOTALS                                  01790099
018000     ELSE                                                         01800094
018100         MOVE  '   **BAD DISCOUNT CODE**' TO ERR-MSG              01810099
018200     END-IF                                                       01820086
018300     .                                                            01830086
018400                                                                  01840036
018500 450-GET-DISC-PCT.                                                01850094
018600     MOVE 0 TO WS-DISCPCT                                         01860094
018700     IF DISC01                                                    01870094
018800         MOVE 0.02 TO WS-DISCPCT                                  01880099
018900     ELSE                                                         01890094
019000         IF DISC02                                                01900099
019100             MOVE 0.04 TO WS-DISCPCT                              01910099
019200         ELSE                                                     01920099
019300             IF DISC03                                            01930099
019400                 MOVE  0.06 TO WS-DISCPCT                         01940099
019500             ELSE                                                 01950099
019600                 IF DISC04                                        01960099
019700                     MOVE 0.08 TO WS-DISCPCT                      01970099
019800                 END-IF                                           01980099
019900             END-IF                                               01990099
020000         END-IF                                                   02000099
020100     END-IF                                                       02010094
020200     MULTIPLY REC-INV-AMT BY WS-DISCPCT                           02020094
020300       GIVING WS-DISCOUNT ROUNDED                                 02030094
020400     .                                                            02040094
020500                                                                  02050094
020600 500-CALC-TOTALS.                                                 02060099
020700     ADD REC-INV-AMT TO DEPT-AMT                                  02070099
020800     ADD WS-DISCOUNT TO DEPT-DISC                                 02080099
020900     ADD WS-NET TO DEPT-NET                                       02090099
021000     .                                                            02100099
021100                                                                  02110099
021200 600-DIV-TOTALS.                                                  02120099
021300     PERFORM 650-DEPT-TOTALS                                      02130099
021400     MOVE HOLD-DIV TO PR-DIV                                      02140099
021500     MOVE '  DIVISION TOTALS ' TO FIN-MSG                         02150099
021600     MOVE DIV-AMT TO PR-AMT                                       02160099
021700     MOVE DIV-DISC TO PR-DISCOUNT                                 02170099
021800     MOVE DIV-NET TO PR-NET                                       02180099
021900     MOVE '**' TO PR-AST                                          02190099
022000     PERFORM 700-PRINT-LINE                                       02200099
022100     MOVE 2 TO WS-SPACING                                         02210099
022200     ADD DIV-AMT TO  FIN-AMOUNT                                   02220099
022300     ADD DIV-DISC TO FIN-DISCOUNT                                 02230099
022400     ADD DIV-NET TO FIN-NET                                       02240099
022500     INITIALIZE DIV-TOTALS                                        02250099
022600     MOVE REC-DIV TO HOLD-DIV                                     02260099
022700     .                                                            02270099
022800                                                                  02280099
022900 650-DEPT-TOTALS.                                                 02290099
023000     MOVE HOLD-DEPT TO PR-DPT                                     02300099
023100     MOVE '  DEPARTMENT TOTALS ' TO FIN-MSG                       02310099
023200     MOVE DEPT-AMT TO PR-AMT                                      02320099
023300     MOVE DEPT-DISC TO PR-DISCOUNT                                02330099
023400     MOVE DEPT-NET TO PR-NET                                      02340099
023500     MOVE '*' TO PR-AST                                           02350099
023600     PERFORM 700-PRINT-LINE                                       02360099
023700     MOVE 2 TO WS-SPACING                                         02370099
023800     ADD DEPT-AMT TO DIV-AMT                                      02380099
023900     ADD DEPT-DISC TO DIV-DISC                                    02390099
024000     ADD DEPT-NET TO DIV-NET                                      02400099
024100     INITIALIZE DEPT-TOTALS                                       02410099
024200     MOVE REC-DEPT TO HOLD-DEPT                                   02420099
024300     .                                                            02430099
024400                                                                  02440049
024500 700-PRINT-LINE.                                                  02450018
024600     PERFORM 750-WRITE                                            02460018
024700     IF WS-LINE-COUNT > 50                                        02470018
024800         PERFORM 800-PRINT-HEADINGS                               02480018
024900     END-IF                                                       02490018
025000     .                                                            02500018
025100                                                                  02510018
025200 750-WRITE.                                                       02520018
025300     WRITE PRINT-REC FROM WS-PRINT-REC                            02530018
025400       AFTER ADVANCING WS-SPACING LINES                           02540018
025500     END-WRITE                                                    02550018
025600     ADD WS-SPACING TO WS-LINE-COUNT                              02560018
025700     MOVE 1 TO WS-SPACING                                         02570099
025800     MOVE SPACES TO WS-PRINT-REC                                  02580018
025900     .                                                            02590018
026000                                                                  02600018
026100 800-PRINT-HEADINGS.                                              02610018
026200     ADD 1 TO WS-PAGE                                             02620018
026300     MOVE WS-PAGE TO H-PAGE                                       02630018
026400     WRITE PRINT-REC FROM HEADING-1                               02640018
026500       AFTER ADVANCING PAGE                                       02650018
026600     END-WRITE                                                    02660018
026700     MOVE HEADING-2 TO WS-PRINT-REC                               02670018
026800     MOVE 2 TO WS-SPACING                                         02680018
026900     PERFORM 750-WRITE                                            02690018
027000     MOVE 2 TO WS-SPACING                                         02700018
027100     MOVE 0 TO WS-LINE-COUNT                                      02710018
027200     .                                                            02720018
027300                                                                  02730018
027400 850-GET-DATE.                                                    02740018
027500     ACCEPT WS-DATE FROM DATE                                     02750018
027600     MOVE MM TO H-MM                                              02760018
027700     MOVE DD TO H-DD                                              02770018
027800     MOVE YY TO H-YY                                              02780018
027900     ACCEPT WS-TIME FROM TIME                                     02790018
028000     MOVE HH TO H-HH                                              02800018
028100     MOVE MN TO H-MN                                              02810018
028200     .                                                            02820018
028300                                                                  02830086
028400 900-PRINT-TOTALS.                                                02840039
028500     PERFORM 600-DIV-TOTALS                                       02850099
028600     MOVE '  FINAL TOTALS ' TO FIN-MSG                            02860099
028700     MOVE FIN-AMOUNT TO PR-AMT                                    02870044
028800     MOVE FIN-DISCOUNT TO PR-DISCOUNT                             02880044
028900     MOVE FIN-NET TO PR-NET                                       02890044
029000     MOVE '***' TO PR-AST                                         02900099
029100     PERFORM 700-PRINT-LINE.                                      02910099
029200                                                                  02920099
